package com.javarush.test.level05.lesson12.home04;

/* Вывести на экран сегодняшнюю дату
Вывести на экран текущую дату в аналогичном виде "21 02 2014".
*/

public class Solution
{
    public static void main(String[] args)
    {
        String day = "15 ";
        String moun = "07 ";
        String year = "2015";
        System.out.println(day + moun + year);
    }
}
